{
  "treeSubtypes": {
    "root": {
      "name": "Root",
      "range": [1, 12],
      "description": "Deep connection to community and harmony. You are motivated by belonging, peace, and creating safe spaces for others. Your 'bubble' centers on maintaining relationships and ensuring everyone feels included."
    },
    "root_trunk": {
      "name": "Root-Trunk",
      "range": [13, 24],
      "description": "Balances connection with personal growth. You seek harmony while building your own capabilities. You develop skills that help you better support and connect with others."
    },
    "trunk": {
      "name": "Trunk",
      "range": [25, 37],
      "description": "Focused on mastery and self-improvement. You are driven by the desire to become more capable and skilled. Deep knowledge and persistent practice define your approach to growth."
    },
    "trunk_branch": {
      "name": "Trunk-Branch",
      "range": [38, 49],
      "description": "Combines personal mastery with system impact. You develop expertise not just for yourself, but to create meaningful change in your organization or field."
    },
    "branch": {
      "name": "Branch",
      "range": [50, 62],
      "description": "Driven by impact and contribution. You think in systems and focus on creating lasting change. Your motivation comes from seeing how your work affects the broader picture."
    },
    "branch_leaf": {
      "name": "Branch-Leaf",
      "range": [63, 74],
      "description": "Merges impact with exploration. You create change through innovation and new approaches. You're motivated by both making a difference and discovering new possibilities."
    },
    "leaf": {
      "name": "Leaf",
      "range": [75, 87],
      "description": "Energized by novelty and discovery. You thrive on new experiences, fresh starts, and exploring uncharted territory. Change and variety fuel your motivation."
    },
    "leaf_root": {
      "name": "Leaf-Root",
      "range": [88, 99],
      "description": "Bridges exploration with connection. You seek new experiences that bring people together. Your adventures are more meaningful when shared with others."
    }
  },
  "measures": {
    "bucket": {
      "low": {
        "range": [1, 33],
        "description": "Single-bucket focus. You prefer deep, concentrated engagement in one area at a time. Depth over breadth defines your approach."
      },
      "medium": {
        "range": [34, 66],
        "description": "Balanced buckets. You manage a few key areas simultaneously, finding the sweet spot between focus and variety."
      },
      "high": {
        "range": [67, 99],
        "description": "Multi-bucket juggler. You thrive with many simultaneous interests and activities. Variety energizes you."
      }
    },
    "thickness": {
      "low": {
        "range": [1, 33],
        "description": "Permeable boundaries. You deeply feel and absorb the energy around you. Work and life blend together naturally."
      },
      "medium": {
        "range": [34, 66],
        "description": "Flexible boundaries. You can adjust your walls as needed, sometimes open, sometimes protected."
      },
      "high": {
        "range": [67, 99],
        "description": "Strong boundaries. You maintain clear separation between different areas of life. You stay centered regardless of external chaos."
      }
    },
    "input": {
      "low": {
        "range": [1, 33],
        "description": "Selective input. You prefer targeted, relevant information when you need it. Quality over quantity in learning."
      },
      "medium": {
        "range": [34, 66],
        "description": "Moderate input. You balance active learning with processing time. You seek information with purpose."
      },
      "high": {
        "range": [67, 99],
        "description": "Wide input. You constantly gather information from many sources. Learning is like breathing for you."
      }
    },
    "output": {
      "low": {
        "range": [1, 33],
        "description": "Narrow output. You share selectively, when asked or when necessary. You process internally before expressing."
      },
      "medium": {
        "range": [34, 66],
        "description": "Balanced output. You share appropriately to context. You know when to speak and when to listen."
      },
      "high": {
        "range": [67, 99],
        "description": "Wide output. You actively share thoughts and ideas. Processing happens through expression and dialogue."
      }
    }
  },
  "interactionArchetypes": {
    "harmonious_nurturer": {
      "name": "Harmonious Nurturer",
      "orientation": "people",
      "expression": "narrow",
      "description": "You quietly maintain group harmony and support others behind the scenes. Your strength lies in deep, trusted relationships where you share insights when directly asked."
    },
    "inspiring_connector": {
      "name": "Inspiring Connector",
      "orientation": "people",
      "expression": "wide",
      "description": "You actively build community through enthusiastic sharing of experiences and stories. Your energy creates inclusive environments that motivate others."
    },
    "grounded_analyst": {
      "name": "Grounded Analyst",
      "orientation": "fact",
      "expression": "narrow",
      "description": "You focus on accuracy and depth, sharing expertise when consulted. Your credibility comes from consistency and precision rather than volume."
    },
    "impactful_driver": {
      "name": "Impactful Driver",
      "orientation": "fact",
      "expression": "wide",
      "description": "You push for results through clear communication of goals and data. Your persistent messaging and logical influence drive change at scale."
    }
  },
  "strengthDescriptions": {
    "high": {
      "range": [70, 100],
      "label": "Pure Type",
      "description": "Your motivational pattern is clear and focused. You have a strong, dominant driver."
    },
    "medium": {
      "range": [40, 69],
      "label": "Blended Type",
      "description": "You draw from multiple motivational sources. Your flexibility allows you to adapt to different contexts."
    },
    "low": {
      "range": [0, 39],
      "label": "Highly Flexible",
      "description": "You're motivated by many things equally. Your adaptability is your superpower."
    }
  }
}